test_cases/channelFlow1D/0.SA/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{    
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    top
    {
        type            symmetryPlane;
    }
    
    left
    {
        type            cyclic;
    }
    
    right
    {
        type            cyclic;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
    
    processor
    {
    	type            processor;
    	value           $internalField;
    }
}

// ************************************************************************* //
